# Курс: AI+Python
# Модуль 7. Кортежі, множини, словники
# Тема: Словники. Частина 3


# Завдання 1
# Напишіть функцію, яка отримує 2 словника та об’єднує їх в один.
# Якщо ключі співпадають то потрібно додати відповідні їм значення.


def two_dicts(dict_1: dict, dict_2: dict) -> dict:
    result = dict_1.copy()

    for key, value in dict_2.items():
        if key in result:
            result[key] += value
        else:
            result[key] = value

    return result


dict_1 = {"Молоко": 80, "Картопля": 20}
dict_2 = {"Картопля": 25, "Апельсини": 70}

print(two_dicts(dict_1, dict_2))


# Завдання 2
# Напишіть функцію, яка отримує словник та інвертує його, тобто повертає новий словник,
# де ключі та значення змінені місцями.


def invertor_dict(d):
    result = {}

    for key, value in d.items():
        result[value] = key

    return result


data = {"Валерій": 1000, "Ігор": 1500, "Віктор": 2000}
print(invertor_dict(data))

# Завдання 3
# Користувач вводить назви товарів та їх ціни поки не введе порожній рядок.
# Збережіть дані у словник. Якщо користувач вводить товар повторно та треба додати стару та нову ціни.
# В кінці виведіть таблицею товар – ціна. Також виведіть загальну ціну.

products = {}

while True:
    name = input("\nВведіть назву товарів (повторний Enter зупиняє): ")
    if name == "":
        break

    price = float(input("Введіть ціну н  а товар: "))

    if name in products:
        products[name] += price
    else:
        products[name] = price

print("\nТаблиця товарів")

total = 0

for name, price in products.items():
    print(name, "-", price)
    total += price

print("Загальна сума:", total)

# Завдання 4
# Напишіть функцію, яка отримує текст та повертає
# словник, де ключі – це слова, а значення – їхня кількість в
# тексті.
# Добавте параметр за замовчуванням який визначає, чи
# Практичне завдання
# значення в словнику будуть кількостями слів, чи
# частотою(відсотком від загальної кількості).


# Завдання 5
# Створіть словник, де ключі – це назви груп, а значення –
# списки студентів, що належать до цих груп.
# Реалізуйте 3 функції для додавання та видалення студентів
# з груп, а також для виведення даних на екран


# Завдання 6
# Напишіть функцію, яка запитує в користувача ім’я, вік,
# посаду та повертає ці дані у вигляді словника.
# Створіть іншу функцію, яка добавляє 5 людей у словник,
# де ключ ім’я, а значення – словник з попередньої функції.
# Після чого виведіть середній вік.
