# Курс: AI+Python
# Модуль 8. Файли. Винятки
# Тема: Файли. Частина 2

#    ЗАВДАННЯ 1
# Є текстовий файл. Виведіть кількість рядків та кількість символів в ньому

with open("folder_main_h-w_19.03.26/population.txt") as file:
    text = file.read()

count_chars = len(text)
print("Кількість символів у файлі 'population.txt' = ", count_chars)

count_lines = text.count("\n") + 1
print("Кількість рядків у файлі 'population.txt'", count_lines)


#   ЗАВДАННЯ 2
# Користувач вводить ім’я та вік. Запишіть їх у файл.
# Назву файлу також вводить користувач(без розширення .txt)



#   ЗАВДАННЯ 3
# Є текстовий файл. Запишіть його рядки в інший файл.



#   ЗАВДАННЯ 4
# Користувач вводить літеру та назву файлу.
# Виведіть усі слова з файлу, які починаються на цю літеру.



#   ЗАВДАННЯ 5
# Є текстовий файл. Замініть у ньому усі символи * на &, та навпаки.



#   ЗАВДАННЯ 6
# Напишіть функцію, яка отримує назву файлу та список чисел як параметри.
# Потрібно записати всі числа у файл, розмістивши кожне число на окремому рядку.
# Напишіть іншу функцію, яка отримує назву файл та читає з нього ці числа і повертає як список.



#   ЗАВДАННЯ 7
# Є 2 файли, запишіть у третій файл лише ті символи, які є в обох файлах одночасно



#    ЗАВДАННЯ 8
# Є файл з текстом. Видаліть з нього усі неприйнятні слова.
# Список неприйнятних слів є в іншому файлі.
