print("Hello students IT Step Academy")

# Хід виконання домашнього завдання по Модулю 10 від 19.03.2026р.

# Модуль 10: Системи контролю версій
# Тема: Системи контролю версій.
# Частина 1

# Сьогодні по Україні гарна погода!

#    ЗАВДАННЯ 2
# Створіть папку з двома підпапками. У кожну папку додайте кілька файлів.

#   ЗАВДАННЯ 3
# Створіть репозиторій у головній папці.

#   ЗАВДАННЯ 4
# Додайте вміст двох підпапок в індекс репозиторія за допомогою команди: git add.

#   ЗАВДАННЯ 5
# Створіть commit на підставі підпапок, доданих в індекс. Використайте команду: git commit.

#   ЗАВДАННЯ 6
# Змініть вміст одного з файлів у папці та створіть commit з новими даними.

#   ЗАВДАННЯ 7
# Створіть нову підпапку, наповніть її даними.
# Після наповнення створіть commit із вмістом нової папки.

#   ЗАВДАННЯ 8
# Внесіть зміни у вміст файлу в новій папці, збережіть зміни (не створюйте новий commit).
# Скасуйте зміни в локальній копії файлу за допомогою команди: git checkout.

#   ЗАВДАННЯ 9
# Внесіть зміни у вміст файлу в новій папці, додайте зміни в індекс (не створюйте новий commit).
# Скасуйте зміни в індексі за допомогою команди: git reset.

#   ЗАВДАННЯ 10
# Внесіть зміни у вміст файлу в новій папці, додайте зміни в індекс, створіть новий commit.
# Скасуйте зміни в останньому commit шляхом створення нового commit за допомогою команди: git revert.

# Завдання 11
# Видаліть кілька останніх commit. Використайте команду: git reset з опцією --hard.

# Завдання 12
# Внесіть зміни в останній commit, не створюючи нового. Використайте: git commit з ключем --amend.

# Завдання 13
# Надішліть наявний репозиторій до сайту GitHub

print("Hello students IT Step Academy")
