# ОПЕРАТОРИ РОЗГАЛУЖЕНЬ
# Частина 1
# Рівень 1
# Завдання 1
# Користувач вводить з клавіатури три числа.
# Залежно від вибору користувача програма виводить на екран суму трьох чисел або добуток трьох чисел.
a = float(input("Ввести перше число: "))
b = float(input("Ввести друге число: "))
c = float(input("Ввести третє число: "))
selection = int(
    input("Зробіть вибір: 1 - рахуємо суму; 2 - рахуємо добуток: ")
)  # вибір розрахунку
if selection == 1:
    print("Сума чисел: ", a + b + c)
if selection == 2:
    print("Добуток чисел: ", a * b * c)

# Завдання 2
# Користувач вводить з клавіатури три числа.
# # Залежно від вибору користувача програма виводить на екран MAX із трьох, MIN із трьох або сер-арифм. 3-х чисел.
#
a = float(input("Введіть 1-ше число: "))
b = float(input("Введіть 2-ге число: "))
c = float(input("Введіть 3-тє число: "))
selection = int(
    input("Зробіть вибір (1 -max число; 2 -min число; 3 -сер.арифметчине): ")
)
if selection == 1:
    if a > b and a > c:
        print("MAX число: ", a)
    elif b > a and b > c:
        print("MAX число: ", b)
    else:
        print("MAX число: ", c)
if selection == 2:
    if a < b and a < c:
        print("MIN число: ", a)
    elif b < a and b < c:
        print("MIN число: ", b)
    else:
        print("MIN число: ", c)
if selection == 3:
    print("Середнє арифметичне: ", (a + b + c) / 3)
else:
    print("Не ВІРНО! Виберіть/Введіть число від 1 до 3")

# РІВЕНЬ 2
# Завдання 3
# Користувач вводить число, що представляє оцінку за шкалою від 1 до 5.
# Програма повинна вивести текстову інтерпретацію оцінки:
# Дуже погано.
# Погано.
# Задовільно.
# Добре.
# Відмінно.
grade = int(input("Введіть оцінку від 1 до 5: "))
if grade == 1:
    print("Дуже погано")
elif grade == 2:
    print("Погано")
elif grade == 3:
    print("Задовільно")
elif grade == 4:
    print("Добре")
elif grade == 5:
    print("Відмінно")
else:
    print("Ви ввели некоректне число. Виберіть від 1 до 5")

# Завдання 4
# Користувач вводить з клавіатури кількість метрів.
# Програма має запропонувати кілька варіантів перекладу і, залежно від вибору користувача,
# перевести метри в одну або кілька одиниць виміру.
# Можливі варіанти:
# Перевести в одну з одиниць на вибір: милі, дюйми або ярди.
# Перевести одразу в усі три одиниці (милі, дюйми та ярди) і вивести результати для кожної.
# Перевести в кілометри та сантиметри, якщо користувач обирає цей варіант.

metr = float(input("Введіть кількість метрів: "))
choice = int(
    input(
        "Перевести метри в милі-1, дюйми-2, ярди-3, милі & дюйми & ярди-4, км & см -5: "
    )
)

mile = 0.00062137  # кіл-сть миль в 1 метрі
inches = 39.37  # кіл-сть дюймів в 1 метрі
yard = 1.0936  # кіл-сть ярдів в 1 метрі
kilometer = 1 / 1000  # кіл-сть кілометрів в 1 метрі
centimeter = 1 * 100  # кіл-сть сантиметрів в 1 метрі

if choice == 1:
    print(f"Миль: {metr*mile}")
elif choice == 2:
    print(f"Дюймів: {metr*inches}")
elif choice == 3:
    print(f"Ярдів: {metr*yard}")
elif choice == 4:
    print(f"Миль: {metr*mile}, Дюймів: {metr*inches}, Ярдів: {metr*yard}")
elif choice == 5:
    print(f"Кілометрів: {metr*kilometer}, сантиметрів {metr*centimeter}")
else:
    print("Не порахує! Виберіть діапазон від 1 до 5 !")

# Рівень 3
# Завдання 5
# Користувач вводить два числа і вибирає операцію (додавання, віднімання, множення, ділення, знаходження залишку,
# піднесення до степеня). Програма повинна виконати вибрану операцію і вивести результат.
metr = float(input("Введіть кількість метрів: "))
choice = int(
    input(
        "Перевести метри в милі-1, дюйми-2, ярди-3, милі & дюйми & ярди-4, км & см -5: "
    )
)

mile = 0.00062137  # кіл-сть миль в 1 метрі
inches = 39.37  # кіл-сть дюймів в 1 метрі
yard = 1.0936  # кіл-сть ярдів в 1 метрі
kilometer = 1 / 1000  # кіл-сть кілометрів в 1 метрі
centimeter = 1 * 100  # кіл-сть сантиметрів в 1 метрі

if choice == 1:
    print(f"Миль: {metr*mile}")
elif choice == 2:
    print(f"Дюймів: {metr*inches}")
elif choice == 3:
    print(f"Ярдів: {metr*cores}")
elif choice == 4:
    print(f"Миль: {metr*mile}, Дюймів: {metr*inches}, Ярдів: {metr*cores}")
elif choice == 5:
    print(f"Кілометрів: {metr*kilometer}, сантиметрів {metr*centimeter}")
else:
    print("Не вірно! Виберіть діапазон від 1 до 5 !")

# Завдання 6+
# Користувач вводить тризначне число. Програма повинна визначити, чи всі цифри числа однакові.
# Якщо всі цифри однакові, вивести «Всі цифри однакові», інакше — «Цифри різні».

number = int(input("Введіть тризначне число: "))

n1 = number // 100
n2 = (number // 10) % 10
n3 = number % 10

print(n1)
print(n2)
print(n3)

if n1 == n2 == n3:
    print("Всі цифри однакові")
else:
    print("Всі цифри різні")
