# ДОМАШНЄ ЗАВДАННЯ №2 - Тема: Змінні та типи даних
# РІВЕНЬ 1 - Завдання 1
# Користувач вводить з клавіатури три числа. Необхідно знайти суму чисел, добуток чисел.
# Результат обчислень вивести на екран

a = float(input("Введіть число a: "))
b = float(input("Введіть число b: "))
c = float(input("Введіть число c: "))
print(f"Сума чисел: {a+b+c}")
print(f"Добуток чисел: {a*b*c}")

# Завдання 2
# Напишіть програму, що обчислює площу ромба. Користувач з клавіатури вводить довжину двох його діагоналей.
# ВИКОНАННЯ ЗАВДАННЯ через окрему формулу площі ромба по 2-м діагоналям
d1 = float(input("Введіть діагональ d1: "))
d2 = float(input("Введіть діагональ d2: "))
area_of_rombus = (d1 * d2) / 2
print("Площа ромба:", area_of_rombus)

# РІВЕНЬ 2 - Завдання 3
# Користувач вводить з клавіатури три числа.
# Перше число - зарплата за місяць, друге число — сума місячного платежу за кредитом у банку,
# третє число — заборгованість за комунальні послуги.
# Необхідно вивести на екран суму, яка залишиться у користувача після всіх виплат.
salary = float(input("Зарплата за місяць: "))
credit = float(input("Сума місячного платежу за кредитом у банку: "))
utilities = float(input("Заборгованість за комунальні послуги: "))
print("Сума після всіх виплат: ", salary - credit - utilities)

# Завдання 4
# Напишіть програму, яка обчислює вартість поїздки на автомобілі.
# Користувач вводить відстань у кілометрах, витрату палива на 100 кілометрів і ціну за літр бензину.
# Програма повинна вивести підсумкову вартість поїздки.
distance = float(input("Відстань у кілометрах: "))
fuel = float(input("Витрата палива на 100 кілометрів: "))
price = float(input("Ціна за літр бензину: "))
print(f"Вартість поїздки становить: {distance*(fuel/100)*price}")
# або 2-м способом
cost_of_the_trip = distance * (fuel / 100) * price
print("Вартість поїздки становить", cost_of_the_trip)

# РІВЕНЬ 3 - Завдання 5
# Користувач вводить загальну суму рахунку в ресторані та кількість осіб, які будуть ділити рахунок.
# Напишіть програму, яка розраховує суму чайових (15% від загальної суми) і загальну суму, включаючи чайові.
# Потім програма повинна розділити загальну суму з чайовими на кількість осіб і вивести, скільки кожна людина має заплатити.
summa_restorant = float(input("Загальна сума рахунку в ресторані: "))
number_of_people = int(input("Кількість осіб: "))

tips = summa_restorant * 15 / 100  # 15% чайових від загальної суми
amount_tips = summa_restorant + tips  # загальна сума з чайовими

print(f"Сума чайових (15% від загальної суми: {tips}")
print(f"Загальна сума рахунку враховуючи чайові: {amount_tips}")
print(f"Кожна людина має заплатити: {amount_tips/number_of_people}")

# Завдання 6
# Користувач вводить вартість оренди автомобіля за день, кількість днів оренди та суму застави, яку потрібно внести.
# Напишіть програму, яка розраховує загальну вартість оренди (з урахуванням застави) і виводить суму,
# яку необхідно заплатити користувачеві після повернення автомобіля (припускаючи, що застава повертається повністю).
# Програма повинна також розділити підсумкову суму оренди (без застави) на кількість днів і вивести вартість оренди за один день.
car_rental_day = float(input("Вартість оренди авто за день: "))
number_of_days = int(input("Кількість днів оренди: "))
deposit_amount = float(input("Сума внесення застави: "))

amount_rent = car_rental_day * number_of_days  # сума оренди БЕЗ застави
total_rental_deposit = amount_rent + deposit_amount  # сума оренди ІЗ заставою

print(f"Загальна вартість оренди (із заставою): {total_rental_deposit}")
print(f"Сума оплати після повернення авто: {amount_rent}")
print(f"Вартість оренди авто за один день: {amount_rent / number_of_days}")
