# Завдання 1
# Користувач вводить текст і набір символів. Видаліть з тексту всі
# слова, що містять хоча б один з цих символів, і виведіть результат.

text = input("Введіть якийсь текст: ")
symbols = input("Введіть набір символів: ")

words = text.split()  # змінна з розбивкою на окремі слова
correct_words = []  # накопичувач кількості слів без символів

for word in words:
    ok = 1
    for x in symbols:
        if x in word:
            ok = 0
    if ok:
        correct_words.append(word)
print("Слова без зайвих символів: ", " ".join(correct_words))


# Завдання 2
# Створіть програму, яка із введеного тексту створює "зворотний текст"
# (перевертає текст на рівні слів, а не символів). Наприклад, "я люблю Python"
# перетворюється на "Python люблю я"

text = input("Введіть будь-який текст: ")  # Я люблю Python
words = text.split()
words = words[::-1]
new_reversed_text = " ".join(words)
print("Текст в перевернутому виді: ", new_reversed_text)

# Завдання 3
# Напиши програму, яка читає з консолі 1 рядок і визначає, чи є він валідним ідентифікатором змінної,
# валідний ідентифікатор має правила:

# Перший символ це латинська літера A-Z або a-z або символ підкреслення _
# Далі можуть бути латинські літери, цифри або _
# Довжина від 1 до 20 символів включно

# Треба вивести:
# OK - якщо рядок валідний
# NO - якщо не валідний

# Приклади
# Валідні:
# name
# _temp
# user1
# A
# var_20

# Не валідні:
# 1user (починається з цифри)
# my-name (дефіс не дозволений)
# hello world (пробіл)
# `` (порожній рядок)
# this_identifier_is_too_long (довше 20)

import re

line = input("Введіть новий рядок: ")
print(
    "OK - рядок валідний"
    if re.match(r"^[A-Za-z_][A-Za-z0-9_]{0,19}$", line)
    else "NO - рядок не валідний"
)
