# Функції
# Частина 1
# Рівень 1
# Завдання 1
# Напишіть функцію, яка відображає на екран форматований текст, зазначений нижче:
# "Don't compare yourself with anyone in this world…
#     if you do so, you are insulting yourself."
#         Bill Gates
from tabnanny import check


def text():
    print(
        "\"Don't compare yourself with anyone in this world… "
        "\n\tif you do so, you are insulting yourself."
        '" \n\t\tBill Gates'
    )


text()

# Завдання 2
# Напишіть функцію, яка приймає два числа як параметр і відображає всі парні числа між ними.


def func(n1: int, n2: int):
    step = 1 if n1 < n2 else -1  # створена умова на випадок якщо 1-ше число більше 2-го

    for num in range(n1 + step, n2, step):
        if num % 2 == 0:
            print(f"Парні числа між {n1} та {n2} є: ", num)


func(1, 15)

# Рівень 2
# Завдання 3
# Напишіть функцію, яка відображає порожній або заповнений квадрат з деякого символу.
# Функція приймає як параметри: довжину сторони квадрата, символ і змінну логічного типу:
# якщо вона дорівнює True, квадрат заповнений;
# якщо False, квадрат порожній.

print("Будуємо квадратік")


def square(length, symbol, parameter):
    for sq in range(length):  # преребираємо довжину рядка для буд. квадрата
        if parameter or sq == 0 or sq == length - 1:
            print(symbol * length)
        else:
            print(symbol + " " * (length - 2) + symbol)


square(5, "*", False)  # аргументи для передачі параметрів функції

# Завдання 4
# Напишіть функцію, яка повертає мінімальне з п'яти чисел. Числа передаються як параметри


def numbers(n1, n2, n3, n4, n5):
    ls = [n1, n2, n3, n4, n5]  # генеруємо параметри у список
    print("Мінімальне число: ", min(ls))


numbers(n1=5, n2=2, n3=3, n4=15, n5=4)  # аргументи для передачі параметрів функції

# Рівень 3
# Завдання 5
# Напишіть функцію, яка рахує кількість цифр у числі. Число передається як параметр.
# З функції потрібно повернути отриману кількість цифр. Наприклад, якщо передали 3456, кількість цифр буде 4.

# Виконання завдання через змінну ->
numbers = 12345678910  # створена змінна для функції


def count_num(n: int):
    return len(str(n))  # повертаємо значення


print("Кількість введених цифр =", count_num(numbers))


# Виконання завдання через виклик функції ->
def count_num(n: int):
    print("Кількість введених цифр =", len(str(n)))


count_num(n=20252026)  # аргумент для параметрів функції

# Завдання 6
# Напишіть функцію, яка перевіряє чи є число паліндромом. Число передається як параметр.
# Якщо число паліндром, потрібно повернути з функції true, інакше false.
# "Паліндром" — це число, у якого перша частина цифр дорівнює другій перевернутій частині цифр.
# Наприклад, 123321 — паліндром (перша частина 123, друга 321, яка після перевороту стає 123),
# 546645 — паліндром, а 421987 — не паліндром.

number = 1233215  # створюємо змінну для передачі в аргумент функції (можно без неї)


def palindrome(num):
    return (
        str(num) == str(num)[::-1]
    )  # переводимо в строку і через return визн. параметр True або False


check = palindrome(num=number)  # прописуємо аргумент для параметрів функції

print(f"Чи є число {number} паліндромом?")
if check:  #
    print(check, "- Так, це число є Паліндром")
else:
    print(check, "- Ні це число не є паліндром")
