# Курс: AI+Python
# Модуль 6. Функції
# Тема: Функції. Частина 5

# Завдання 1
# Напишіть функцію для обрахунку температури склянки води, яку помістили в холодильник через деякий час
# Параметри:
#  T_env – температура в холодильнику
#  T0 – початкова температура води
#  t – час у секундах проведений в холодильнику
#  k – коефіцієнт охолодження, за замовчуванням 0.05
#   Формула для обрахунку:
#       T_new = T_env + (T0 - T_env) * exp(-kt)
# Див math.exp()

import math


def temp_glass_of_water(
    T_env: float, T0: float, t: float, k: float = 0.05
) -> float:  # функція з параметрами
    # Опис документації щодо роботи даної функції
    """
    Робить обрахунок температури склянки води в холодильнику за певний час
    Логіка виконання:
        a) користувач вводить наступні дані:
            - температура в холодильнику - T_env;
            - початкова температура води - Т0;
            - час(сек.) проведений в холодильнику - t
            - коефіцієнт охолодження - k=0.05
        b) формула для обрахунку: T_new = T_env + (T0 - T_env) * exp(-k*t) (закон охолодження Ньютона)
        c) використовуємо імпорт math
    :return: повертаємо float (T_new нова температура води)
    """  # docstring (документація рядка)
    T_new = T_env + (T0 - T_env) * math.exp(
        -k * t
    )  # формула самого розрахунку нової температури
    return T_new  # повертає нову температуру


T_env = 5  # змінна для показу темп-ри в холодильнику (не обов'язково)
T0 = 50  # змінна для показу темп-ри води в склянці (не обов'язково)
t = 60
# змінна для показу часу (не обов'язково)

result = temp_glass_of_water(T_env, T0, t)

print(f"Температура в холодильнику: {T_env} °C")
print(f"Температура води в склянці: {T0} °C")
print(
    f"Температура склянки води через {t} секунд = {(round(result,2))}°C\n"
)  # можна ще через {result:.2f}


# Завдання 2
# Напишіть функцію з параметром show_time, яка запитує в користувача ім’я та повертає його.
# Якщо show_time = True, то функція повинна вивести на екран час своєї роботи у секундах.
# Див time.time()

import time


def useer_name(show_time: bool = True) -> str:  # функція з bool-параметром "show_time"
    # Опис документації щодо роботи даної функції
    """
    Запитує користувача ім'я та повертає його
    Якщо show_time = True, то функція виводить час своєї роботи (у секундах)
    Логіка виконання:
    - використовуємо бібліотеку time.time()
    - зробити умову для параметра show_time
    - використовуємо цикл while
    :param show_time: boolean
    :return: str (повертає Ім'я та час роботи)
    """  # docstring (документація рядка)

    start_time = time.time()  # початок роботи функції (написання ім'я)
    while True:
        name = str(input("Введіть своє їм'я: "))  # запитуємо ім'я користувача
        if name != "":  # умова, якщо порожній рядок
            break
        print("Введене ім'я не може бути порожнім!")

    end_time = (
        time.time()
    )  # кінець роботи функції (натискання ENTER після написання ім'я)
    function_time = (
        end_time - start_time
    )  # формула обрахунку тривалості роботи функції (тобто написання ім'я)

    if show_time:
        print(f"Час роботи функції після вводу імені склав - {function_time:.3f} сек.")
    return name


if __name__ == "__main__":  # для визначення точки входу програми
    name = useer_name(show_time=True)
    print(f"Привіт, шановний {name}!")
