# ЦИКЛИ
# Частина 1
# Рівень 1
# Завдання 1
# Користувач вводить із клавіатури два числа (початок і кінець діапазону).
# Потрібно проаналізувати всі числа в цьому діапазоні за таким правилом: якщо число кратне 7, його треба виводити на екран.
num_1 = int(input("Введіть початок діапазону: "))
num_2 = int(input("Введіть кінець діапазону: "))
while num_1 <= num_2:
    if num_1 % 7 == 0:
        print("Число-", num_1, "кратне 7")
    num_1 += 1
else:
    print("Аналіз діапазону чисел завершено")


# Завдання 2
# Користувач вводить із клавіатури два числа (початок і кінець діапазону).
# Потрібно проаналізувати всі числа в цьому діапазоні. Потрібно вивести на екран:
# Усі числа діапазону.
# Усі числа діапазону в спадному порядку.
# Усі числа, кратні 7.
# Кількість чисел, кратних 5.
start = int(input("Введіть числовий початок діапазону: "))
finish = int(input("Введіть числовий кінець діапазону: "))

counter = start
print("Усі числа діапазону в зростаючому порядку:")
while counter <= finish:
    print(counter)
    counter += 1

counter = finish
print("Усі числа діапазону в спадному порядку:")
while counter >= start:
    print(counter)
    counter -= 1

counter = start  # Лічильник чисел у діапазоні
count_5 = 0  # Накопичення кількості чисел кратних 5
multiplicity_7 = False  # наявність чисел кратних 7
print("Числа які кратні - 7")
while counter <= finish:
    if counter % 7 == 0:
        print(counter)
        multiplicity_7 = True  # створене булеве значення якщо counter !=0
    if counter % 5 == 0:
        count_5 += 1
    counter += 1

if not multiplicity_7:
    print("В цьому діапазоні відсутні числа кратні 7")

print("Кількість чисел кратних 5: ", count_5)
print("Аналіз діапазону чисел завершено")

# Рівень 2
# Завдання 3
# Користувач вводить із клавіатури два числа (початок і кінець діапазону).
# Потрібно проаналізувати всі числа в цьому діапазоні.
# Виведення на екран має відбуватися за правилами, зазначеними нижче.
# Якщо число кратне 3 (ділиться на 3 без залишку) потрібно вивести слово "Fizz".
# Якщо число кратне 5 потрібно вивести слово "Buzz". Якщо число кратне 3 і 5 потрібно вивести "Fizz Buzz".
# Якщо число не кратне не 3 і 5 потрібно вивести саме число.
start = int(input("Введіть числовий початок діапазону: "))
finish = int(input("Введіть числовий кінець діапазону: "))
count = start
print("Аналіз чисел діапазону")
while count <= finish:
    if count % 3 == 0 and count % 5 == 0:
        print(f"FizzBuzz (число {count} ділиться на 3 і 5)")
    elif count % 3 == 0:
        print(f"Fizz (число {count} ділиться на 3)")
    elif count % 5 == 0:
        print(f"Buzz (число {count} ділиться на 5)")
    else:
        print(f"Число {count} не ділиться на 3 і 5")
    count += 1

# Завдання 4
# Користувач вводить два числа і крок (інтервал), з яким потрібно проходити по діапазону.
# Програма має показати числа від початку діапазону до кінця, збільшуючи кожне число на вказаний крок.
# Також програма повинна надавати вибір порядку виведення: у прямому або зворотному порядку.
start = int(input("Введіть числовий початок діапазону: "))
finish = int(input("Введіть числовий кінець діапазону: "))
step = int(input("Введіть інтервал: "))
output = input("Порядок виведення (direct or reverse): ")


if output == "direct":
    count = start
    while count <= finish:
        print(count, end=" ")
        count += step
elif output == "reverse":
    count = finish
    while count >= start:
        print(count)
        count -= step
print("\nДіапазон завершений")

# Рівень 3
# Завдання 5
# Користувач вводить два числа, що представляють діапазон.
# Програма повинна пройти по діапазону і вивести добуток усіх чисел, які діляться на 4, але не діляться на 6.
# Якщо таких чисел немає, вивести відповідне повідомлення.
# Діапазон має автоматично нормалізуватися, якщо початок більший за кінець.
start = int(input("Введіть числовий початок діапазону: "))
finish = int(input("Введіть числовий кінець діапазону: "))

if start > finish:
    start = finish and finish == start

number = start  # лічильник чисел у діапазоні
calculate = 1  # накопичувальник добутку
finding = False  # індикатор знаходження чисел діапазону

while number <= finish:
    if number % 4 == 0 and number % 6 != 0:
        print("Перелік чисел, які підходять умові: ", number)
        calculate *= number
        finding = True
    number += 1
if finding:
    print("Добуток чисел які діляться на 4, але не діляться на 6 =", calculate)
else:
    print("В діапазоні відсутні числа, які діляться на 4, але не діляться на 6")

# Завдання 6
# Користувач вводить два числа: число A і ступінь N, у який потрібно піднести число.
# Програма повинна обчислити A у степені N за допомогою циклу (без використання вбудованих функцій піднесення до степеня).
A = int(input("Введіть число: "))
degree = int(input("Ступінь піднесення да числа: "))
variable = 1  # змінна для використання як степень (оминаючи вбуд.функцію **)
count = 0  # лічильник
while count < degree:
    variable = variable * A
    count += 1
print(f"Число {A} в {degree} степені = {variable}")
