# Модуль: Кортежі, множини, словники
# Частина 1

# Завдання 1
# Маємо три кортежі цілих чисел. Знайдіть елементи, які є у всіх кортежах.

tuple_num1 = (1, 2, 3, 4, 5, 6)  # 1-й кортеж
tuple_num2 = (2, 3, 4, 5, 6, 7)  # 2-й кортеж
tuple_num3 = (3, 4, 5, 6, 7, 8)  # 3-й кортеж

common_numbers = set(tuple_num1).intersection(
    tuple_num2, tuple_num3
)  # змінна конвертованих кортежів у множини

print(
    f"Елементи 1-го кортежу {tuple_num1}\n"
    f"Елементи 2-го кортежу {tuple_num2}\n"
    f"Елементи 3-го кортежу {tuple_num1}\n\n"
    f"Елементи які є у 3-х кортежах ",
    common_numbers,
)  # повернення змінної

# АБО можно виконати задачу через оператор-  &
common_numbers = (
    set(tuple_num1) & set(tuple_num2) & set(tuple_num3)
)  # змінна конв-их кортежів у множини через  &

print(
    f"\nЕлементи 1-го кортежу {tuple_num1}\n"
    f"Елементи 2-го кортежу {tuple_num2}\n"
    f"Елементи 3-го кортежу {tuple_num1}\n\n"
    f"Елементи які є у 3-х кортежах: {common_numbers}\n"
)

# Завдання 2
# Маємо три кортежі цілих чисел. Знайдіть елементи, які унікальні для кожного списку.

tuple_1 = (1, 2, 0, 0, 0, 4)  # 1-й кортеж
tuple_2 = (3, 3, 5, 4, 4, 1)  # 2-й кортеж
tuple_3 = (9, 7, 9, 6, 8, 8)  # 3-й кортеж

plural_1 = set(tuple_1)  # конвертуємо у множину, яка поверне унікальні значення
plural_2 = set(tuple_2)  # - // - // -
plural_3 = set(tuple_3)  # - // - // -

print(
    f"Унікальні елементи у 1-му кортежі: {plural_1}\n"
    f"Унікальні елементи у 2-му кортежі: {plural_2}\n"
    f"Унікальні елементи у 3-му кортежі: {plural_3}\n"
)

# АБО можно виконати задачу визначивши елементи, які є в одному кортежі, але в інших відсутні

unique_numbers_1 = (
    plural_1 - plural_2 - plural_3
)  # визначаємо всі унікальні елементи для plural_1 (відсутні в інших)
unique_numbers_2 = (
    plural_2 - plural_1 - plural_3
)  # визначаємо всі унікальні елементи для plural_2 (відсутні в інших)
unique_numbers_3 = (
    plural_3 - plural_1 - plural_2
)  # визначаємо всі унікальні елементи для plural_3 (відсутні в інших)

print(
    f"Унікальні елементи для 1-го списку: {unique_numbers_1}\n"
    f"Унікальні елементи для 2-го списку: {unique_numbers_2}\n"
    f"Унікальні елементи для 3-го списку: {unique_numbers_3}\n"
)

# Завдання 3
# Маємо три кортежі цілих чисел. Знайдіть елементи, які є в кожному з кортежів і
# знаходяться в кожному з них на тій самій позиції.


cortege_1 = tuple(
    map(int, input("Введіть числа для 1-го кортежу через пробіл: "))
)  # ввід чисел для 1-го кортежу
cortege_2 = tuple(
    map(int, input("Введіть числа для 2-го кортежу через пробіл: "))
)  # ввід чисел для 2-го кортежу
cortege_3 = tuple(
    map(int, input("Введіть числа для 3-го кортежу через пробіл: "))
)  # ввід чисел для 3-го кортежу

res = []  # список для елементів, які мають збіг по однакових позиціях

for x1, x2, x3 in zip(
    cortege_1, cortege_2, cortege_3, strict=False
):  # цикл/перебір елементів в 3-х кортежів (через zip)
    if x1 == x2 == x3:  # порівнюємо отримані по циклу елементи
        res.append(
            x1
        )  # додаємо елемент у список, якщо він однаковий у всіх кортежах на цій позиції

print(
    "Елементи, які є у 3-х кортежах на однакових позиціях: ", res
)  # вивід список результатів (можна додати *)
