# Рядки. Списки
# Частина 2
# Рівень 1
# Завдання 1
# Користувач з клавіатури вводить список цілих чисел.
# Необхідно порахувати, скільки у списку парних і непарних чисел. Результати вивести на екран.

user_numbers = input("Введіть список цілих чисел: ")
numbers = list(map(int, user_numbers))  # переводимо рядок у список та цілі числа

evens_num = 0  # лічильник для парних чисел
odds_num = 0  # лічильник для не парних

for number in numbers:
    if number % 2 == 0:
        evens_num += 1
    else:
        odds_num += 1
print("Кількість парних: ", evens_num)
print("Кількість не парних: ", odds_num)

# Завдання 2
# Користувач із клавіатури вводить список цілих чисел.
# Необхідно визначити максимальне і мінімальне значення у списку. Результати вивести на екран.

numbers = input("Введіть список цілих чисел: ")
numbers = list(map(int, numbers))
print("Максимальне значення: ", max(numbers))
print("Мінімальне значення ", min(numbers))
print("Сума значень", sum(numbers))

# Рівень 2
# Завдання 3
# У списку цілих, заповненому випадковими числами, визначити мінімальний, додатний елемент і
# максимальний, від'ємний елемент, порахувати кількість від'ємних елементів, порахувати кількість додатних елементів,
# порахувати кількість нулів. Результати вивести на екран.
import random

ls = [random.randint(-10, 20) for _ in range(10)]  # генеруємо випадкові числа
min_pos = []  #   список мінімальних додатних елементів
max_neg = []  #   список максимальних від'ємних елементів

num_neg = 0  #   лічильник від'ємних елементів
num_pos = 0  #   лічильник додатних елементів
num_zero = 0  #   лічильник 0-ів

for num in ls:
    if num < 0:
        num_neg += 1
    else:
        num_pos += 1
    if num == 0:
        num_zero += 1
    if num > 0:
        min_pos.append(num)
    else:
        max_neg.append(num)

print("Список випадкових чисел: ", ls)
print("Мінімальний додатний елемент: ", min(min_pos))
print("Максимальний від'ємний елемент: ", min(max_neg))
print("Кількість від'ємних чисел: ", num_neg)
print("Кількість додатних чисел: ", num_pos)
print("Кількість нулів: ", num_zero)

# Завдання 4
# Користувач із клавіатури вводить список цілих чисел і деяке число.
# Необхідно видалити зі списку всі елементи, які менші за задане число. Результат вивести на екран.

list_num = input("Введіть список цілих чисел: ")
some_num = int(input("Введіть деяке число: "))

numbers = list(map(int, list_num))  # створюємо змінну-список
res = []
for num in numbers:
    if num >= some_num:
        res.append(num)  # додаємо в результат елемент(в кінець)

print(
    "Числа, які >= заданого числа: ", *sorted(res)
)  # результат із методом розпак.* та сортування

# Рівень 3
# Завдання 5
# Користувач вводить з клавіатури арифметичний вираз. Наприклад, 23+12.
# Необхідно вивести на екран результат виразу. У нашому прикладі це 35.
# Арифметичний вираз може складатися тільки з трьох частин: число, операція, число. Можливі операції: +, -, *, /.

arithmetic_exp = input("Введіть арифметичний вираз(напр.23+12): ")

if "+" in arithmetic_exp:
    a, b = arithmetic_exp.split("+")
    print("Результат виразу = ", float(a) + float(b))
elif "-" in arithmetic_exp:
    a, b = arithmetic_exp.split("-")
    print("Результат виразу = ", float(a) - float(b))
elif "*" in arithmetic_exp:
    a, b = arithmetic_exp.split("*")
    print("Результат виразу = ", float(a) * float(b))
elif "/" in arithmetic_exp:
    a, b = arithmetic_exp.split("/")
    print("Результат виразу = ", float(a) / float(b))
else:
    print("Введено не вірний арифметичний вираз")

# Завдання 6
# Користувач із клавіатури вводить список цілих чисел.
# Необхідно відсортувати цей список так, щоб від'ємні числа залишилися на своїх місцях,
# решта елементів були відсортовані за зростанням. Результат вивести на екран.

list_int = input("Ведіть список цілих чисел: ")
list_int = list(map(int, list_int.split()))

positive_num = []  # створюємо список відокремлених додатних чисел

for num in list_int:
    if num >= 0:
        positive_num.append(num)
positive_num.sort()

sort_num = []  # створюємо список для виводу
element = 0  # лічильник перебраних елементів

for num in list_int:
    if num < 0:
        sort_num.append(num)
    else:
        sort_num.append(positive_num[element])  #
        element += 1
print("Результат відсортованих чисел: ", *sort_num)
