# РЕКУРСІЯ
# Завдання 1
# Напишіть рекурсивну функцію, яка обчислює суму цифр заданого числа.
# Приклад:
# Введення: 123
# Виведення: 6 (оскільки 1+2+3=6)


num = 1245  # змінна/аргумент для введення числового набору і використання


def sum_num(n):
    if n == 0:  # звичайна умова коли рекурсія дійде до 0
        return 0  # повернення якщо умова вірна
    else:
        return n % 10 + sum_num(n // 10)  # рекурсія через звичайну арифметику


sum_num(num)
print(
    f"Сума цифр заданого числа {num} = ", sum_num(num), "\n"
)  # виводимо результат, але з функції

# Завдання 2
# Напишіть рекурсивну функцію, яка перевіряє, чи заданий список є симетричним.
# Симетричний список - це список у якому елементи зліва направо і справа наліво збігаються.
# Приклад:
# Введення [1,2,3,3,2,1]
# Висновок: "Список симетричний"

numbers = [
    0,
    1,
    2,
    3,
    3,
    2,
    1,
    0,
]  # змінна-ввід для передачі в аргументи ф-ії -> параметри та "красоти" виводу у print


def symmetric(num):
    if len(num) <= 1:  # звичайна умова через довжину
        return True  # булеве значення якщо симетрично
    if num[0] != num[-1]:  # порівняння
        return False  # булеве значення якщо не симетрично
    return symmetric(num[1:-1])  # рекурсія для визначення симетричності чисел


# symmetric([1,2,3,3,2,1])    # закоментований виклик функції (на всяк випадок)
if symmetric(numbers):
    print(f"Висновок: Список {numbers} є симетричний\n")
else:
    print(f"Висновок: Список {numbers} не є симетричний\n")

# Написати гру "Бики та корови". Програма "загадує" чотирицифрове число і гравець має відгадати його.
# Після введення користувачем числа програма повідомляє, скільки цифр числа вгадано (бики) і скільки цифр вгадано
# і стоїть на потрібному місті (корови). Після відгадування числа на екран необхідно вивести кількість
# зроблених користувачем спроб. У програмі необхідно використовувати рекурсію!

import random

secret_numbers = str(random.randint(0, 9999))
print("Гра.\n Відгадай загадане програмою 4-х цифрове число!")


def game_cows_bulls(chance=1):
    number_attempts = (
        3  # кількість спроб задля упередження безліч безрезультативних спроб
    )

    if chance == 1:
        print(f"У Вас є {number_attempts} спроб\n")

    if chance > number_attempts:
        return f"Ваш ліміт вичерпано. Програмка загадало число - {secret_numbers}"

    print(f"У Вас залишилось {number_attempts - chance + 1} спроб")

    guess = input(f"Спроба - {chance}. Введіть 4-значне число: ")

    cows = 0  # лічильник корів
    bulls = 0  # лічильник биків

    for i in range(4):  # звичайний цикл підрахунку чисел
        if guess[i] == secret_numbers[i]:
            cows += 1
        elif guess[i] in secret_numbers:
            bulls += 1

    if guess == secret_numbers:  # застосовуємо у разі успішно вгаданого
        return f"Ви вгадали число за {chance} спроб!"

    print(
        f"Кількість вгадано (Бики): {bulls},\nВгадано і на своєму місці (Корови): {cows}"
    )
    return game_cows_bulls(chance + 1)  # рекурсія


game_cows_bulls()  # виклик функції
