# Модуль 6. Функції
# Тема: Функції. Частина 4
# Завдання 1
# Напишіть гру Правда або Дія.
# Опис:
# 1. Спочатку, введіть імена гравців.
# 2. Кожен гравець по черзі обирає "Правда" або "Дія".
# 3. Якщо гравець обрав "Правда", йому задається запитання, на яке він повинен відповісти правдиво.
# 4. Якщо "Дія", гравець повинен виконати вказане завдання.
# 5. Після завершення кожного раунду, виведіть результати.

# Функції:
# get_player_names(): Запитайте імена гравців і поверніть їх у вигляді списку.

# ask_truth_or_dare(player): Функція, яка приймає ім'я гравця та запитує його, чи обирати "Правда" або "Дія".

# ask_truth_question(player): Функція, яка приймає ім'я гравця, вибере одне запитання випадковим чином та
# просить гравця дати відповідь.

# perform_dare(player): Функція, яка приймає ім'я гравця та вибирає одне завдання випадковим чином та
# просить гравця виконати його.

# play_game(players): Функція, яка керує ходом гри.

# Послідовно запитайте кожного гравця, чи обирати "Правда" або "Дія", а потім відповідно викликайте
# функцію ask_truth_question або perform_dare.
# Константи:
# questions – список питань
# dares – список завдань

import random  # імпортуємо random для question та dares

# створюємо константи:
questions = [
    "Який твій улюблений вид спорту?",
    "Чи боїшся ти темряви?" "Яка твоя найкраща подорож?",
    "Які пригоди ти полюбляєш?",
    "Як часто ти палиш?",
    "Тобі часто доводиться обманювати?",
    "Про що ти мрієш?",
]
dares = [
    "Зроби 20 віджимань від полу",
    "Заспівай улюблену пісню",
    "Станцюй Ламбаду",
    "Зроби 20 присідань",
    "Зателефонуй по рандомному номеру",
]


# створюємо Функції!
def get_player_names():  # функція, в якій ми запитуємо імена гравців і повертаємо їх у вигляді списку!
    """
    TODO:
    Запитайте імена гравців і поверніть їх у вигляді списку
    Логіка виконання:
    - користувач вводить імена кожного гравця;
    - перевірка на порожній рядок, якщо так - введення завершується;
    - повертається список імен.
    :return:
    - list[str]: імена гравців повертаємо у вигляді списку
    """
    players = []

    while True:
        name = input(
            "Введіть ім'я гравця (натисніть двічі ENTER для завершення вводу): "
        ).strip()
        if name == "":
            break
        players.append(name)
    return players


def ask_truth_or_dare(
    player,
):  # функція, яка приймає ім'я гравця та запитує його, чи обирати "Правда" або "Дія"
    """
    TODO:
    Зробити гравцю вибір: "Правда" або "Дія"
    :param player:  player (str):  - це ім'я гравця
    :return:    str: "Правда" або "Дія"
    Логіка виконання:
    - використовуємо цикл "while" для перевірки коректності вводу
    - використовуємо метод "lower" для ігнорування регістру
    """
    while True:
        choice = input(f"{player}, обери 'Правда' або 'Дія': ").strip().lower()
        if choice in ["правда", "дія"]:
            return choice
        else:
            print("Некоректний вибір. Спробуйте ще раз!")


def ask_truth_question(
    player,
):  # Функція, що приймає ім'я гравця, вибере 1 запитання (random) та просить гравця дати відповідь.
    """
    TODO
    Випадковим (random) способом вибрати питання зі списку "questions" та вивести його гравцю
    :param player:  player (str):  - це ім'я гравця
    Логіка виконання:
    - використовуємо random.choice (sequence) тобто->  випадково.вибір(послідовність)
    """
    question = random.choice(questions)
    print(f"{player}, твоє питання:")
    print(question)

    input("Натисни ENTER після відповіді ...")


def perform_dare(
    player,
):  # Функція, що приймає ім'я гравця та вибирає 1 завдання (random) та просить гравця виконати його.
    """
    TODO
    Випадковим (random) способом вибрати ЗАВДАННЯ зі списку "dare" та вивести його гравцю
    :param player:  player (str):  - це ім'я гравця
    Логіка виконання:
    - використовуємо random.choice(sequence) тобто->  випадково.вибір(послідовність)
    """
    dare = random.choice(dares)
    print(f"{player}, твоє завдання:")
    print(dare)
    input("Натисни ENTER після виконання ...")


def play_game(players):  # Функція, яка керує ходом гри.
    """
    TODO
    Основна функція керування грою.

    :param players:  players (str):  - це список імен всіх гравців
    Логіка виконання:
    - проходимо по кожному гравцю через цикл "for"
    - викликаємо функцію "ask_truth_or_dare()"
    - залежно від вибору гравця викликаємо:
        - ask_truth_question()
            або
        - perform_dare()
    - після кожного раунду виводимо повідомлення
    """
    print("\nПОЧАТОК ГРИ !")
    for player in players:
        choice = ask_truth_or_dare(player)
        if choice == "правда":
            ask_truth_question(player)
        else:
            perform_dare(player)
        print(f"Раунд для {player} завершено")
    print("ГРА ЗАВЕРШЕНА!")


if __name__ == "__main__":
    players = get_player_names()

    if len(players) == 0:
        print("Недостатньо гравців")
    else:
        play_game(players)
