#   Завдання 1:
# користувач вводить:
# час відправлення: години h (0–23) і хвилини m (0–59)
# тривалість дороги: t хвилин (може бути більше 60 і навіть більше 1440)
#  Потрібно вивести:
# час прибуття у форматі HH:MM
# скільки повних діб пройде під час дороги (0, 1, 2, …)
#  Приклад:
#    Ввід: 23 50 і 125
#    Прибуття: 01:55
#    Діб пройшло: 0 (бо менше - 24 год)
hour = int(input("Час відправлення, год.: "))
minute = int(input("Час відправлення, хв.: "))
time_m = int(input("Тривалість дороги, хв.: "))

start_minute = hour * 60 + minute  # початок руху у хвилинах
all_minute = start_minute + time_m  # тривалість дороги у хвилинах
arrival_min_in_day = all_minute % 1440  # кількість діб
arrival_hour = arrival_min_in_day // 60  # прибуття у годинах
arrival_minute = arrival_min_in_day % 60  # прибуття у хвилинах

full_day_in_road = time_m // 1440
print(f"Прибуття: {arrival_hour}:{arrival_minute}")
print(f"Діб пройшло: {full_day_in_road}")

#    Завдання 2:
# Умова:
# Користувач вводить 4-значне число (наприклад, 5831). Потрібно:
# вивести окремо кожну цифру (по одній в рядок)
# знайти суму цифр
# сформувати число навпаки (5831 → 1385)
# сформувати число з перших двох цифр і останніх двох цифр (наприклад 58 і 31)
user = int(input("Введіть 4-значне число: "))
x = user
x1 = x // 1000
x2 = (x // 100) % 10
x3 = (x // 10) % 10
x4 = x % 10
print("Вивід окремих цифр: " "\n", x1, "\n", x2, "\n", x3, "\n", x4)
print("Сума цифр: ", x1 + x2 + x3 + x4)
print(f"Формуємо число у зворотному порядку: {x4}{x3}{x2}{x1}")
print(f"Число з перших 2-х чисел: {x1}{x2}\nЧисло з останніх 2-х чисел: {x3}{x4}")

#    Завдання 3:
# Користувач вводить суму в гривнях (може бути дробова, наприклад 763.28). Треба:
# перевести суму в копійки (ціле число)
# порахувати, скільки потрібно купюр/монет, щоб видати цю суму мінімальною кількістю для номіналів:
# грн: 200, 100, 50, 20, 10, 5, 2, 1
# коп: 50, 25, 10, 5, 2, 1
# Вивести кількість кожного номіналу та підсумкову кількість усіх купюр/монет.

uah = float(input("Введіть суму у гривнях: "))
kop = int(round(uah * 100))

h200 = kop // 20000
kop %= 20000
h100 = kop // 10000
kop %= 10000
h50 = kop // 5000
kop %= 5000
h20 = kop // 2000
kop %= 2000
h10 = kop // 1000
kop %= 1000
h5 = kop // 500
kop %= 500
h2 = kop // 200
kop %= 200
h1 = kop // 100
kop %= 100

k50 = kop // 50
kop %= 50
k25 = kop // 25
kop %= 25
k10 = kop // 10
kop %= 10
k5 = kop // 5
kop %= 5
k2 = kop // 2
kop %= 2
k1 = kop // 1
kop %= 1

print("Номінал 200грн: ", h200)
print("Номінал 100грн: ", h100)
print("Номінал 50грн: ", h50)
print("Номінал 20 грн: ", h20)
print("Номінал 10грн: ", h10)
print("Номінал 5грн: ", h5)
print("Номінал 2грн: ", h2)
print("Номінал 1грн: ", h1)

print("50 коп: ", k50)
print("25 коп: ", k25)
print("10 коп: ", k10)
print("5 коп: ", k5)
print("2 коп: ", k2)
print("1 коп: ", k1)

print("Кількість всіх купюр/монет: ", h200 + h100 + h50 + h20)
