# Курс: AI+Python
# Модуль 7. Кортежі, множини, словники
# Тема: Множини. Частина 2

#   Завдання 1
# Користувач вводить через кому список товарів.
# Виведіть цей список на екран, але без повторень назв товарів

product_list = input("Введіть список товарів (через кому): ").split()

product_list_1 = list(
    set(product_list)
)  # створено для роздільності введеного списку від унікального

print("\nСписок користувача без повторень назв товарів: ", product_list_1)


#   Завдання 2
# У магазині є два списки клієнтів: ті хто отримав знижкові купони, і ті хто ними скористався.
# Напишіть функцію, яка отримує 2 списки та виводить інформацію:
#  Імена тих, хто отримав купон, але не скористався, також вивести їх кількість
#  Імена шахраїв, які скористались знижкою, але магазин не давав їм купони


def legitimate_scammers(received: list, used: list) -> None:
    # переводимо у множини для швидкого підрахунку
    set_received = set(received)
    set_used = set(used)

    not_used = (
        set_received - set_used
    )  # знаходимо імена клієнтів хто тримав, але не скористався
    scammers = set_used - set_received  # знаходимо імена шахраїв

    print(
        "\nКлієнти, які отримали знижкові купони але не скористались: ",
        ", ".join(not_used) or "Таких немає",
    )
    print("Кількість таких клієнтів: ", len(not_used))

    print(
        "Імена шахраїв, які скористались знижкою, але магазин не давав їм купони: ",
        ", ".join(scammers),
    )
    print("Кількість шахраїв: ", len(scammers))


received = ["Валерій", "Альона", "Іван", "Марія", "Софія"]
used = ["Валентина", "Галя", "Степан"]

legitimate_scammers(received, used)
