# Курс: AI+Python
# Модуль 7. Кортежі, множини, словники
# Тема: Словники. Частина 4

#   Завдання 1
# Є словник з курсами валют, де ключ – назва валюти, значення – курс до гривні.
# Користувач вводить назву валюти, суму та назву нової валюти, в яку треба перевести суму.
# Підказка 1: для того, щоб перевести, скажімо, 10 доларів у євро, спочатку треба перевести 10 доларів у гривні,
# після чого гривні переводити у євро.
#   Підказка 2: щоб можна було переводити долари у гривні(або гривні у долари), потрібно щоб у словнику була
#               інформація скільки гривень в 1 гривні


def convert_currency() -> None:
    """
    Проста консольна програма для конвертації валют.

    Логіка роботи:
    1. Користувач вводить:
        - вихідну валюту (наприклад, USD, EUR, UAH),
        - суму,
        - валюту, у яку потрібно конвертувати.
    2. Програма бере курси валют зі словника CURRENCY_RATES.
    3. Конвертація відбувається за формулою:
            сума * курс_вихідної / курс_цільової
    4. Результат виводиться з округленням до 2 знаків після коми.
    """

    # Словник курсів валют до гривні.
    # Ключі — коди валют, значення — скільки 1 одиниця валюти коштує у гривнях.

    CURRENCY_RATES = {
        "USD": 44.16,
        "EUR": 50.95,
        "UAH": 1.0,
        "PLN": 11.96,
        "GBP": 59.07,
        "CNY": 6.43,
    }

    # ЗЧИТУВАННЯ ДАНИХ ВІД КОРИСТУВАЧА
    from_currency = input(
        "Вкажіть вихідну валюту (доступні USD, EUR, UAH, PLN, GBR, CNY) : "
    )
    amount = float(input("Сума конвертації: "))
    to_currency = input("Валюта в яку конвертуємо: ")

    # РОЗРАХУНОК КОНВЕРТАЦІЇ
    result = amount * CURRENCY_RATES[from_currency] / CURRENCY_RATES[to_currency]

    # ВИВІД РЕЗУЛЬТАТУ
    print(f"{amount:.2f} {from_currency} = {result:.2f} {to_currency}")


# ВИКЛИК ФУНКЦІЇ
convert_currency()


#   Завдання 2
# Напишіть функцію, яка отримує 2 множини з іменами працівників, які працюють в офісі та віддалено.
# Виведіть на екран:
#  Імена усіх працівників
#  Імена працівників, які працюють і в офісі, і віддалено
#  Відсоток працівників, які працюють і в офісі, і віддалено


def process_employees(office_workers: set, remote_workers: set) -> None:
    """
    Приймає множини працівників, які працюють в офісі та віддалено.
    Виводить:
    1) усіх працівників
    2) працівників, які працюють і в офісі, і віддалено
    3) відсоток працівників, які працюють у двох режимах

    :param office: Set[str] - працівники, які працюють в офісі
    :param remote: Set[str] - працівники, які працюють віддалено
    :return: None
    """
    # TODO:
    # 1. Знайти об'єднання множин (усі працівники)
    # 2. Знайти перетин множин (і там, і там)
    # 3. Обчислити відсоток:

    print("\n---Розбір працівників на офісних та віддалених---")
    # УСІ ПРАЦІВНИКИ
    all_workers = office_workers | remote_workers
    print("Імена усіх працівників:", ", ".join(sorted(all_workers)))

    # ПРАЦІВНИКИ, ЯКІ ПРАЦЮЮТЬ І В ОФІСІ, І ВІДДАЛЕНО
    both_group_workers = office_workers & remote_workers
    print(
        "Працівники, які працюють і в офісі, і віддалено:",
        ", ".join(sorted(both_group_workers)),
    )

    # ВІДСОТОК ПРАЦІВНИКІВ, ЯКІ ПРАЦЮЮТЬ УДВОХ У ДВОХ РЕЖИМАХ
    percent_office_remote = len(both_group_workers) / len(all_workers) * 100
    print(
        f"Відсоток працівників які працюють в обох режимах: {percent_office_remote:.0f} %"
    )


office_workers = {
    "Валерій",
    "Іван",
    "Ігор",
    "Сергій",
    "Василь",
    "Євген",
    "Стас",
    "Денис",
    "Роман",
    "Світлана",
}
remote_workers = {"Валерій", "Іван", "Альона", "Марія", "Софія", "Роман"}

process_employees(office_workers, remote_workers)
