# Hi! Hi! I'm goodbye!
# Good night!

#   ДОМАШНЄ ЗАВДАННЯЧКО (19.03.26)!

# Модуль 10: Системи контролю версій
# Тема: Системи контролю версій. Частина 1

# Завдання 1
# Встановіть і налаштуйте на своєму локальному комп'ютері Git.

# Завдання 2
# Створіть папку з двома файлами.

# Завдання 3
# Створіть репозиторій у цій папці.

# Завдання 4
# Додайте два файли в індекс репозиторія за допомогою команди: git add.

# Завдання 5
# Створіть commit на підставі файлів, доданих в індекс.
# Використайте команду: git commit.

# Завдання 6
# Змініть вміст одного з файлів і створіть commit з новими даними.

# Завдання 7
# Створіть новий файл, наповніть його даними. Після
# наповнення створіть commit з новим файлом.

# Завдання 8
# Внесіть зміни у вміст файлу, збережіть зміни (не створюйте новий commit).
# Скасуйте зміни в локальній копії файлу за допомогою команди: git checkout.

# Завдання 9
# Внесіть зміни у вміст файлу, додайте зміни в індекс (не створюйте новий commit).
# Скасуйте зміни в індексі за допомогою команди: git reset.

# Завдання 10
# Внесіть зміни у вміст файлу, додайте зміни в індекс, створіть новий commit.
# Скасуйте зміни в останньому commit шляхом створення нового commit за допомогою команди: git revert.

# Завдання 11
# Видаліть кілька останніх commit. Використайте команду: git reset з опцією --hard.

# Завдання 12
# Надішліть наявний репозиторій до сайту GitHub