# Курс: AI+Python
# Модуль 7. Кортежі, множини, словники
# Тема: Множини. Частина 2

# Завдання 1
# Користувач вводить числа через кому.
# Збережіть їх у множину. Також створіть власну множину з випадковими числами (12 шт.)
# Виведіть наступну інформацію:
#  Максимальне та мінімальне число введене користувачем, а також кількість чисел
#  Унікальні числа, введені користувачем, яких немає серед випадкових
#  Спільні числа, введені користувачем, які є серед випадкових
#  Усі числа, які є або в одній або в іншій множині

import random

numbers = input("Введіть числа через кому: ").split(",")

# перетворюємо у множину
numbers = set(numbers)
# створюємо випадкову множину
random_set = set(random.randint(1, 50) for i in range(12))
print("\nВипадкові числа: ", random_set)

# вивід наступної інформації:
print("\nВведені числа: ", numbers)
print("\tМаксимальне число: ", max(numbers))
print("Мінімальне число: ", min(numbers))
print("\tКількість чисел: ", len(numbers))

# унікальні числа користувача
unique_user = numbers - random_set
print("\nУнікальні числа від користувача, яких немає серед випадкових:", unique_user)

# спільні числа
common_numbers = numbers & random_set
print("\nСпільні числа користувача з випадковими:", common_numbers)

# об'єднання
union_numbers = numbers | random_set
print("\nУсі числа з обох множин: ", union_numbers)


# Завдання 2
# Напишіть функцію, яка отримує список гостей (гості можуть повторюватись) та назву події.
# Потрібно вивести запрошення для кожного гостя і лише один раз.


def invite(guests: list, event_name: str) -> None:
    unique_guests = set(guests)  # унікальні гості

    for guest in unique_guests:
        print(f"{guest}, welcome on the '{event_name}'!")


guests = ["Valerii", "Alyona", "Ivan", "Maria", "Sofia", "Valerii", "Alyona", "Ivan"]
invite(guests, "Happy Birthday")


# Завдання 3
# Напишіть функцію, яка отримує два списки з назвами товарів для покупок двох знайомих людей.
# Виведіть наступне повідомлення:
#  Товари, які можна купити разом
#  Товари, які потрібні лише першій людині
#  Товари, які потрібні лише другій людині


def shopping(list1: list, list2: list) -> None:
    # переводимо у множину для унікальності
    set1 = set(list1)
    set2 = set(list2)

    common = set1 & set2
    only_first = set1 - set2
    only_second = set2 - set1

    print("Товари, які можна купити разом:", common)
    print("Товари лише першої людини:", only_first)
    print("Товари лише другої людини:", only_second)


person1 = ["молоко", "хліб", "сир", "яйця"]
person2 = ["хліб", "масло", "сир", "кава"]

shopping(person1, person2)

# Завдання 4
# Організатор конференції створив 3 списки учасників:
# зареєстровані, ті хто оплатив участь і ті хто підтвердив свою присутність
# Напишіть функцію, яка отримує ці 3 списки та виводить наступну інформацію:
#  Імена тих, хто зареєструвався, але не оплатив участь
#  Імена тих, хто підтвердив присутність, але не зареєстрований
#  Імена тих, хто оплатив участь, але не підтвердив присутність
#  Імена тих, хто зареєструвався та оплатив участь
#  Імена тих хто пройшов усі 3 етапи


def conference(registered: list, paid: list, confirmed: list) -> None:
    R = set(registered)  # зареєстровані
    P = set(paid)  # оплатили
    C = set(confirmed)  # підтвердили

    print("Зареєструвались, але не оплатили участь :", R - P)
    print("Підтвердили, але не зареєстровані: ", C - R)
    print("Оплатили, але не підтвердили присутність: ", P - C)
    print("Зареєструвались і оплатили участь: ", R & P)
    print("Пройшли усі 3 етапи: ", R & P & C)


registered = ["Валерій", "Альона", "Іван", "Марія", "Софія", "Ігор", "Світлана"]
paid = ["Валерій", "Ігор", "Іван"]
confirmed = ["Марія", "Софія", "Альона"]

conference(registered, paid, confirmed)

# Завдання 5
# Менеджер організовує навчання для своїх співробітників, для чого розділив їх на 3 групи,
# кожна з яких буде навчатись у свій день.
# Напишіть функцію, яка отримує 3 списки з іменами та список усіх співробітників.
# Потрібно перевірити чи не помилився менеджер, а саме:
#  Чи не забули включити якогось співробітника(якщо так, то вивести імена всіх, про кого забули)
#  Чи випадково немає співробітників, які опинились у двох групах(якщо так, то теж вивести повідомлення)


def check_training_groups(
    group1: list, group2: list, group3: list, all_employees: list
) -> None:
    G1 = set(group1)
    G2 = set(group2)
    G3 = set(group3)
    ALL = set(all_employees)

    #   Перевірка пропущених
    groups_union = G1 | G2 | G3
    missing = ALL - groups_union

    if missing:
        print("Забули включити в групу: ", missing)
    else:
        print("Усі співробітники розподілені.")

    #   Перевірка дублювання
    duplicates = (G1 & G2) | (G1 & G3) | (G2 & G3)

    if duplicates:
        print("Співробітники, які є у двох групах: ", duplicates)
    else:
        print("Перетинів між групами немає.")


all_employees = ["Валерій", "Альона", "Іван", "Марія", "Софія", "Ігор", "Світлана"]

group1 = ["Валерій", "Альона"]
group2 = ["Іван", "Марія"]
group3 = ["Ігор", "Софія"]

check_training_groups(group1, group2, group3, all_employees)
