# Курс: AI+Python
# Модуль 7. Кортежі, множини, словники
# Тема: Словники. Частина 4

# Завдання 1
# Користувач вводить імена людей, поки не введе порожній рядок.
# Збережіть усі імена в множині. Якщо ім’я вводиться повторно, то вивести повідомлення про це.
# Виведіть кількість людей

people = set()

while True:
    person_name = input("Введіть імена людей: ")

    if person_name == "":
        break

    if person_name in people:
        print("Таке ім'я вже введено!")
    else:
        people.add(person_name)

print("Кількість введених людей: ", len(people))


# Завдання 2
# Студентів розбили на 2 групи, кожна з яких навчається у свій день.
# Перевірте чи не виникло помилки, а саме:
#  Чи немає студентів які є у двох групах одночасно(якщо є, то вивести їх імена)
#  Чи немає студентів, про яких забули(якщо є, то вивести імена)
# Напишіть відповідну функцію, яка отримує два списки з іменами студентів кожної групи, та список усіх студентів.
# Додатково: змініть код, якщо груп 3


def сheck_groups(all_students, group1, group2, group3) -> None:
    all_set = set(all_students)
    set1 = set(group1)
    set2 = set(group2)
    set3 = set(group3)

    # перевірка студентів у 3-х групах одночасно
    duplicates = (set1 & set2) | (set1 & set3) | (set2 & set3)

    # перевірка забутих студентів
    forgotten_students = all_set - (set1 | set2 | set3)

    if duplicates:
        print("\nСтуденти у всіх 3-х групах одночасно: ", duplicates)
    else:
        print("\nДублювання студентів немає!")

    if forgotten_students:
        print("\nСтудентів забули включити: ", forgotten_students)
    else:
        print("\nСтуденти розподілені по всім групам!")


all_students = ["Валерій", "Іван", "Ігор", "Роман", "Василь", "Стас", "Євген", "Денис"]
group1 = ["Валерій", "Іван", "Ігор"]
group2 = ["Роман", "Василь"]
group3 = ["Стас", "Євген"]

сheck_groups(all_students, group1, group2, group3)

# Завдання 3
# Є словник з цінами продуктів, де ключ – назва продукту, а значення – ціна за кг.
# Організуйте просту роботу магазину:
# користувач вводить назву продукту та вагу, потрібно вивести загальну ціну.

products = {"Апельсини": 60, "Банани": 50, "Яблука": 70, "Ківі": 130, "Хурма": 90}

name = input("ВВедіть назву продуктів: ")
weight = float(input("Введіть вагу(кг): "))
if name in products:
    total = products[name] * weight
    print("До сплати:", total)
else:
    print("Такого продукту немає!")

# Завдання 4
# Є словник з інформацією про вміст вітаміну С в різних продуктах,
# де ключ – назва продукту, значення – вміст вітаміну С у мг.
# Користувач вводить свій раціон: список з назвами продуктів
# Обчисліть вміст вітаміну -С- в раціоні(якщо у словнику немає якогось продукту, вважайте вміст вітаміну рівним 0 мг).
# Виведіть продукт з найбільшим вмістом вітаміну С.

vitamin_c = {"Апельсини": 60, "Банани": 10, "Яблука": 10, "Ківі": 92.7, "Хурма": 25}

products = input("Введіть продукти (через кому): ").split(", ")

total_vitamin = 0

for product in products:
    product = product.strip()
    total_vitamin += vitamin_c.get(product, 0)

print("Загальний вміст вітаміну C:", total_vitamin, "мг")

max_product = max(vitamin_c, key=vitamin_c.get)
print("Найбільший вміст вітаміну C знаходиться в:", max_product)


# Завдання 5
# Склад футбольної команди розподіляється між такими
# позиціями:
#  воротар – 1
#  захисник – 4
#  півзахисник – 4
#  нападник – 2
# Користувач поступово вводить імена гравців та їх позиції.
# Потрібно зберегти ці дані у словник, де ключ – назва позиції,
# значення – список з іменами гравців на цю позицію. Перевірте
# чи склад команди правильний.
# Також виведіть імена всіх гравців.


# Завдання 6
# Організуйте фільтр товарів в онлайн магазині. Усі товари
# діляться на певні категорії, причому один і той самий товар
# може відноситись до різних категорій. Є словник, де ключі –
# назви категорій, а значення – множини з товарами цієї
# категорії.
# Користувач вводить 2 категорії, виведіть ті товари, які
# відносяться одночасно до цих двох категорій.
# Додатково: змініть код якщо користувач вводить декілька
# категорій.
