# Змінні та типи даних
# Частина 2
# Рівень 1
# Завдання 1
# Користувач вводить з клавіатури температуру за шкалою Цельсія.
# Потрібно перевести температуру в градуси за Фаренгейтом і вивести на екран.
celsius = float(input("Введіть температуру в градусах Цельсія: "))
fahrenheit = celsius * 9 / 5 + 32
print("Температура за Фаренгейтом:", fahrenheit)

# Завдання 2
# Користувач вводить із клавіатури значення в євро.
# Напишіть програму, яка переводить цю суму в долари, використовуючи курс євро, введений з клавіатури.
# Результат виводиться на екран.
euro = float(input("Введіть суму в євро: "))
curs = float(input("Введіть курс в Євро до доларах: "))
dollar = euro * curs
print("Сума в доларах: ", dollar)

# Завдання 3
# Користувач з клавіатури вводить двозначне число. Наприклад, 26.
# Потрібно показати на різних рядках значення першого і другого розряду. У нашому випадку це буде виглядати так:
# 2
# 6
number = input("Введіть двозначне число: ")
print(number[0])
print(number[1])

# Завдання 4
# Користувач вводить із клавіатури дві цифри.
# Необхідно створити число, що містить ці цифри.
# Наприклад, якщо з клавіатури введено 9, 7, тоді потрібно сформувати число 97.
a = int(input("Введіть першу цифру: "))
b = int(input("Введіть другу цифру: "))
number = a * 10 + b
print(number)

# Завдання 5
# Користувач із клавіатури вводить тризначне число. Наприклад, 891.
# Потрібно показати на різних рядках значення першого, другого і третього розряду.
# Також потрібно показати на окремому рядку суму цих трьох чисел. У нашому випадку це виглядатиме так:
# 8
# 9
# 1
# 18
number = int(input("Введіть тризначне число: "))
a = number // 100
b = (number // 10) % 10
c = number % 10
print(a)
print(b)
print(c)
print(a + b + c)

# Завдання 6
# Користувач вводить суму вкладу та відсоткову ставку. Напишіть програму, яка:
# Обчислює, скільки користувач отримає через 5 років, якщо щороку сума вкладу збільшується на вказаний відсоток.
# Виводить суму вкладу за кожен рік окремо.
