# 1
# Створіть програму, яка відображає меню з опціями для вибору:
# 1 — додавання двох чисел, 2 — віднімання двох чисел, 3 — ділення двох чисел,
# 4 — вихід. Програма має запитувати в користувача номер опції і, якщо обрано
# пункт 1, 2 або 3, запитувати введення двох чисел, після чого виконувати обрану
# операцію: додавати (якщо обрано 1), віднімати (якщо обрано 2) або ділити
# (якщо обрано 3) введені числа. Результат операції має бути виведено на екран.
# У разі вибору пункту 4 програма завершує роботу, виводячи повідомлення про
# вихід. Якщо введено некоректну опцію, програма має повідомити про помилку і
# знову показати меню. Програма має працювати в циклі, повторюючи виведення меню
# і виконання дій доти, доки не буде обрано вихід.
from random import choice

while True:
    print("Меню: ")
    print("1 - додавання двох чисел")
    print("2 - віднімання двох чисел")
    print("3 - ділення двох чисел")
    print("4 - вихід")
    choice = input("Оберіть пункт з меню ")
    if choice == "1":
        a = int(input("Введіть перше число: "))
        b = int(input("Введіть друге число: "))
        result = a + b
        print("Результат додавання: ", result)
    elif choice == "2":
        a = int(input("Введіть перше число: "))
        b = int(input("Введіть друге число: "))
        result = a - b
        print("Результат віднімання: ", result)
    elif choice == "3":
        a = int(input("Введіть перше число: "))
        b = int(input("Введіть друге число: "))
        if b == 0:
            print("Помилка! Ділити на нуль не можна!")
        else:
            result = a / b
            print("Результат ділення: ", round(result, 2))
    elif choice == "4":
        print("Вихід з програми")
        break
    else:
        print("Помилка! Некоректний вибір!")

# 2
# Користувач вводить висоту трикутника і символ для заповнення. Програма повинна відобразити рівносторонній трикутник.
# Приклад введення:
# Введіть висоту трикутника: 4.
# Введіть символ: #.
# Приклад виведення:
#    #
#   ###
#  #####
# #######

height = int(input("Введіть висоту трикутника: "))
symbol = input("Введіть символ: ")
for i in range(1, height + 1):
    space = height - i
    symbol_2 = 2 * i - 1
    print(" " * space + symbol * symbol_2)

# 3
# Написати програму, яка перевіряє користувача на знання таблиці множення.
# Програма виводить на екран два числа, користувач має ввести їхній добуток.
# Розробити кілька рівнів складності (відрізняються складністю та кількістю запитань).
# Наприклад, в рівні буде 10 запитань, необхідно порахувати кількість вірних і не вірних відповідей.
# Вивести користувачеві оцінку його знань. якщо відповів 3 з 10 - оцінка не задовільно,
# 5 з 10 - задовільно, 8 з 10 - добре, 10 з 10 - відмінно
